In [1]:
import pandas as pd
import numpy as np

01

In [2]:
cat = pd.read_csv('cat.csv')
cat.head()

,first_name,last_name,Genre,M1,M2,M3,Y1,Y2
0,Arlena,Rulton,Drama,97.18,0.088130,78,0.0,1.0
1,Othilia,Shailer,Comedy|Drama,103.84,0.066219,79,0.0,1.0
2,Hyman,Oxshott,Children|Drama,99.12,0.008806,88,0.0,1.0
3,Dallas,Forster,Action|Adventure|Sci-Fi,100.77,0.061354,97,0.0,1.0
4,Jeddy,Woolnough,Drama,101.94,0.040866,80,0.0,1.0

In [3]:
def fun(x):
    if x == 'Horror':
        return 2
    if x == 'Drama':
        return 1
    else:
        return 0

In [4]:
cat['coded'] = cat['Genre'].apply(fun)

In [5]:
cat['coded'].sum()

np.int64(184)

In [6]:
total_sum = cat['coded'].sum().item()  # преобразование к обычному числу
print(total_sum)

184